centrevillage/igb_sdk/igb_stm32/periph/spi.hpp
#pragma once

#include <igb_stm32/base.hpp>
#include <igb_util/cast.hpp>
#include <igb_stm32/periph/gpio.hpp>
#include <igb_stm32/periph/rcc.hpp>
#include <igb_util/macro.hpp>
#include <igb_util/reg.hpp>

namespace igb {
namespace stm32 {

#define IGB_SPI ((SPI_TypeDef*)addr)
#define IGB_SPI_REG_ADDR(member) (addr + offsetof(SPI_TypeDef, member))
#define IGB_SPI_REG(member) ((SPI_TypeDef*)IGB_SPI_REG_ADDR(member))

#if defined(STM32H7)
# define SPI_IT_RXP    SPI_IER_RXPIE
# define SPI_IT_TXP    SPI_IER_TXPIE
# define SPI_IT_DXP    SPI_IER_DXPIE
# define SPI_IT_EOT    SPI_IER_EOTIE
# define SPI_IT_TXTF   SPI_IER_TXTFIE
# define SPI_IT_UDR    SPI_IER_UDRIE
# define SPI_IT_OVR    SPI_IER_OVRIE
# define SPI_IT_CRCERR SPI_IER_CRCEIE
# define SPI_IT_FRE    SPI_IER_TIFREIE
# define SPI_IT_MODF   SPI_IER_MODFIE
# define SPI_IT_TSERF  SPI_IER_TSERFIE
#endif

#if defined(STM32H7)
enum class SpiMode : uint32_t {
  slave  = 0,
  master = SPI_CFG2_MASTER,
};
enum class SpiStandard : uint32_t {
  motorola = 0,
  ti = SPI_CFG2_SP_0,
};
enum class SpiClockPhase : uint32_t {
  oneEdge = 0,
  twoEdge = SPI_CFG2_CPHA,
};
enum class SpiClockPolarity : uint32_t {
  low = 0,
  high = SPI_CFG2_CPOL,
};
enum class SpiBaudratePrescaler : uint32_t {
  div2 = 0,
  div4 = SPI_CFG1_MBR_0,
  div8 = SPI_CFG1_MBR_1,
  div16 = SPI_CFG1_MBR_1 | SPI_CFG1_MBR_0,
  div32 = SPI_CFG1_MBR_2,
  div64 = SPI_CFG1_MBR_2 | SPI_CFG1_MBR_0,
  div128 = SPI_CFG1_MBR_2 | SPI_CFG1_MBR_1,
  div256 = SPI_CFG1_MBR_2 | SPI_CFG1_MBR_1 | SPI_CFG1_MBR_0,
};
enum class SpiBitOrder : uint32_t {
  msbFirst = 0,
  lsbFirst = SPI_CFG2_LSBFRST,
};
enum class SpiTransDir : uint32_t {
  fullDuplex = 0,
  simplexTx = SPI_CFG2_COMM_0,
  simplexRx = SPI_CFG2_COMM_1,
  halfDuplexRx = SPI_CFG2_COMM_0 | SPI_CFG2_COMM_1,
  halfDuplexTx = SPI_CFG2_COMM_0 | SPI_CFG2_COMM_1 | SPI_CR1_HDDIR,
};
enum class SpiNssMode : uint32_t {
  hardInput  = 0,
  hardOutput = SPI_CFG2_SSOE,
  soft       = SPI_CFG2_SSM,
};
enum class SpiNssPolarity : uint32_t {
  low = 0,
  high = SPI_CFG2_SSIOP,
};
#else
enum class SpiMode : uint32_t {
  slave  = 0,
  master = (SPI_CR1_MSTR | SPI_CR1_SSI),
};
enum class SpiStandard : uint32_t {
  motorola = 0,
  ti = SPI_CR2_FRF,
};
enum class SpiClockPhase : uint32_t {
  oneEdge = 0,
  twoEdge = SPI_CR1_CPHA,
};
enum class SpiClockPolarity : uint32_t {
  low = 0,
  high = SPI_CR1_CPOL,
};
enum class SpiBaudratePrescaler : uint32_t {
  div2 = 0,
  div4 = SPI_CR1_BR_0,
  div8 = SPI_CR1_BR_1,
  div16 = SPI_CR1_BR_1 | SPI_CR1_BR_0,
  div32 = SPI_CR1_BR_2,
  div64 = SPI_CR1_BR_2 | SPI_CR1_BR_0,
  div128 = SPI_CR1_BR_2 | SPI_CR1_BR_1,
  div256 = SPI_CR1_BR_2 | SPI_CR1_BR_1 | SPI_CR1_BR_0,
};
enum class SpiBitOrder : uint32_t {
  msbFirst = 0,
  lsbFirst = SPI_CR1_LSBFIRST,
};
enum class SpiTransDir : uint32_t {
  fullDuplex = 0,
  simplexRx  = SPI_CR1_RXONLY,
  halfDuplexRx = SPI_CR1_BIDIMODE,
  halfDuplexTx = SPI_CR1_BIDIMODE | SPI_CR1_BIDIOE,
};
enum class SpiNssMode : uint32_t {
  hardInput  = 0,
  hardOutput = SPI_CR2_SSOE << 16U,
  soft       = SPI_CR1_SSM,
};
#endif

#if defined(STM32H7)
enum class SpiDataWidth : uint32_t {
  _4bit = SPI_CFG1_DSIZE_0 | SPI_CFG1_DSIZE_1,
  _5bit = SPI_CFG1_DSIZE_2,
  _6bit = SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0,
  _7bit = SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1,
  _8bit = SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
  _9bit = SPI_CFG1_DSIZE_3,
  _10bit = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_0,
  _11bit = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1,
  _12bit = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
  _13bit = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2,
  _14bit = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0,
  _15bit = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1,
  _16bit = SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
  _17bit = SPI_CFG1_DSIZE_4,
  _18bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_0,
  _19bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_1,
  _20bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_0 | SPI_CFG1_DSIZE_1,
  _21bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2,
  _22bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0,
  _23bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1,
  _24bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
  _25bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3,
  _26bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_0,
  _27bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1,
  _28bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
  _29bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2,
  _30bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0,
  _31bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1,
  _32bit = SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0,
};
#elif defined(STM32F4)
enum class SpiDataWidth : uint32_t {
  _8bit = 0,
  _16bit = SPI_CR1_DFF,
};
#else
enum class SpiDataWidth : uint32_t {
  _4bit = SPI_CR2_DS_0 | SPI_CR2_DS_1,
  _5bit = SPI_CR2_DS_2,
  _6bit = SPI_CR2_DS_2 | SPI_CR2_DS_0,
  _7bit = SPI_CR2_DS_2 | SPI_CR2_DS_1,
  _8bit = SPI_CR2_DS_2 | SPI_CR2_DS_1 | SPI_CR2_DS_0,
  _9bit = SPI_CR2_DS_3,
  _10bit = SPI_CR2_DS_3 | SPI_CR2_DS_0,
  _11bit = SPI_CR2_DS_3 | SPI_CR2_DS_1,
  _12bit = SPI_CR2_DS_3 | SPI_CR2_DS_1 | SPI_CR2_DS_0,
  _13bit = SPI_CR2_DS_3 | SPI_CR2_DS_2,
  _14bit = SPI_CR2_DS_3 | SPI_CR2_DS_2 | SPI_CR2_DS_0,
  _15bit = SPI_CR2_DS_3 | SPI_CR2_DS_2 | SPI_CR2_DS_1,
  _16bit = SPI_CR2_DS_3 | SPI_CR2_DS_2 | SPI_CR2_DS_1 | SPI_CR2_DS_0,
};
#endif

#if defined(STM32H7)
enum class SpiFifoThreshold : uint32_t {
  _1data = 0,
  _2data = SPI_CFG1_FTHLV_0,
  _3data = SPI_CFG1_FTHLV_1,
  _4data = SPI_CFG1_FTHLV_0 | SPI_CFG1_FTHLV_1,
  _5data = SPI_CFG1_FTHLV_2,
  _6data = SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_0,
  _7data = SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1,
  _8data = SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1 | SPI_CFG1_FTHLV_0,
  _9data = SPI_CFG1_FTHLV_3,
  _10data = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_0,
  _11data = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_1,
  _12data = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_1 | SPI_CFG1_FTHLV_0,
  _13data = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2,
  _14data = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_0,
  _15data = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1,
  _16data = SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1 | SPI_CFG1_FTHLV_0,
};
#elif defined(STM32F0) || defined(STM32F3) || defined(STM32G431xx)
enum class SpiFifoThreshold : uint32_t {
  half = 0,
  quarter = SPI_CR2_FRXTH,
};
#endif

#if defined(STM32H7)
enum class SpiCrcWidth : uint32_t {
  _4bit = SPI_CFG1_CRCSIZE_0 | SPI_CFG1_CRCSIZE_1,
  _5bit = SPI_CFG1_CRCSIZE_2,
  _6bit = SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0,
  _7bit = SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1,
  _8bit = SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0,
  _9bit = SPI_CFG1_CRCSIZE_3,
  _10bit = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_0,
  _11bit = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1,
  _12bit = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0,
  _13bit = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2,
  _14bit = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0,
  _15bit = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1,
  _16bit = SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0,
  _17bit = (SPI_CFG1_CRCSIZE_4),
  _18bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_0),
  _19bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_1),
  _20bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_0 | SPI_CFG1_CRCSIZE_1),
  _21bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2),
  _22bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0),
  _23bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1),
  _24bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0),
  _25bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3),
  _26bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_0),
  _27bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1),
  _28bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0),
  _29bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2),
  _30bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0),
  _31bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1),
  _32bit = (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0),
};
#elif defined(STM32F0) || defined(STM32F3) || defined(STM32G431xx)
enum class SpiCrcWidth : uint32_t {
  _8bit = 0,
  _16bit = SPI_CR1_CRCL,
};
#endif

enum class SpiState : uint32_t {
#if defined(STM32H7)
  rxWordNotEmpty    = SPI_SR_RXWNE,
  rxPacketAbailable = SPI_SR_RXP,
  txPacketAbailable = SPI_SR_TXP,
  dxPacketAbailable = SPI_SR_DXP,
  endOfTransfer     = SPI_SR_EOT,
  txTransferFull    = SPI_SR_TXTF,
  underrun          = SPI_SR_UDR,
  crcError          = SPI_SR_CRCE,
  modeFault         = SPI_SR_MODF,
  overrun           = SPI_SR_OVR,
  frameFormatError  = SPI_SR_TIFRE,
  dataReloaded      = SPI_SR_TSERF,
  suspendDone       = SPI_SR_SUSP,
  txComplete        = SPI_SR_TXC,
#else
  rxBufNotEmpty    = SPI_SR_RXNE,
  txBufEmpty       = SPI_SR_TXE,
  busy             = SPI_SR_BSY,
  crcError         = SPI_SR_CRCERR,
  modeFault        = SPI_SR_MODF,
  overrun          = SPI_SR_OVR,
  frameFormatError = SPI_SR_FRE,
#endif
};

#if defined(STM32G431xx)
// spi i2s
enum class I2sChannelLength : uint32_t {
  _16bit = 0,
  _32bit
};

