centrevillage/igb_sdk/igb_stm32/periph/spi.hpp
enum class I2sDataLength : uint32_t {
  _16bit = 0,
  _24bit,
  _32bit
};

enum class I2sInActiveClockPolarity : uint32_t {
  low = 0,
  high
};

enum class I2sFormat : uint32_t {
  i2s = 0,
  leftJustified,
  rightJustified,
  pcm
};

enum class I2sMode : uint32_t {
  slaveTx = 0,
  slaveRx,
  masterTx,
  masterRx
};
#endif

template<SpiType SPI_TYPE, GpioPinType MOSI_PIN, GpioPinType MISO_PIN, GpioPinType SCK_PIN>
struct Spi {
  constexpr static auto type = SPI_TYPE;
  constexpr static auto mosi_pin = MOSI_PIN;
  constexpr static auto miso_pin = MISO_PIN;
  constexpr static auto sck_pin = SCK_PIN;
  constexpr static auto addr = STM32_PERIPH_INFO.spi[to_idx(type)].addr;

  IGB_FAST_INLINE static void enableBusClock() {
    const auto& spi_info = STM32_PERIPH_INFO.spi[to_idx(type)];
    spi_info.bus.enableBusClock();
  }

  IGB_FAST_INLINE void enable() { IGB_SPI->CR1 = IGB_SPI->CR1 | SPI_CR1_SPE; }
  IGB_FAST_INLINE void disable() { IGB_SPI->CR1 = IGB_SPI->CR1 & ~SPI_CR1_SPE; }

#if defined(STM32H7)
  RegEnum<IGB_SPI_REG_ADDR(CFG2), SPI_CFG2_MASTER, SpiMode> mode;
  RegEnum<IGB_SPI_REG_ADDR(CFG2), SPI_CFG2_SP, SpiStandard> standard;
  RegEnum<IGB_SPI_REG_ADDR(CFG2), SPI_CFG2_CPHA, SpiClockPhase> clockPhase;
  RegEnum<IGB_SPI_REG_ADDR(CFG2), SPI_CFG2_CPOL, SpiClockPolarity> clockPolarity;
  RegEnum<IGB_SPI_REG_ADDR(CFG1), SPI_CFG1_MBR, SpiBaudratePrescaler> baudratePrescaler;
  RegEnum<IGB_SPI_REG_ADDR(CFG2), SPI_CFG2_LSBFRST, SpiBitOrder> transBitOrder;
  struct SpiTransDirInfo {
    IGB_FAST_INLINE uint32_t operator()() {
      return (IGB_SPI->CR1 & SPI_CR1_HDDIR) | (IGB_SPI->CFG2 & SPI_CFG2_COMM);
    }
    IGB_FAST_INLINE void operator()(SpiTransDir dir) {
      IGB_MODIFY_REG(IGB_SPI->CR1, SPI_CR1_HDDIR,  as<uint32_t>(dir) & SPI_CR1_HDDIR);
      IGB_MODIFY_REG(IGB_SPI->CFG2, SPI_CFG2_COMM, as<uint32_t>(dir) & SPI_CFG2_COMM);
    }
  };
  SpiTransDirInfo transDir;
#else
  RegEnum<IGB_SPI_REG_ADDR(CR1), SPI_CR1_MSTR | SPI_CR1_SSI, SpiMode> mode;
  RegEnum<IGB_SPI_REG_ADDR(CR2), SPI_CR2_FRF, SpiStandard> standard;
  RegEnum<IGB_SPI_REG_ADDR(CR1), SPI_CR1_CPHA, SpiClockPhase> clockPhase;
  RegEnum<IGB_SPI_REG_ADDR(CR1), SPI_CR1_CPOL, SpiClockPolarity> clockPolarity;
  RegEnum<IGB_SPI_REG_ADDR(CR1), SPI_CR1_BR, SpiBaudratePrescaler> baudratePrescaler;
  RegEnum<IGB_SPI_REG_ADDR(CR1), SPI_CR1_LSBFIRST, SpiBitOrder> transBitOrder;
  RegEnum<IGB_SPI_REG_ADDR(CR1), SPI_CR1_RXONLY | SPI_CR1_BIDIMODE | SPI_CR1_BIDIOE, SpiTransDir> transDir;
#endif

#if defined(STM32H7)
  RegEnum<IGB_SPI_REG_ADDR(CFG1), SPI_CFG1_DSIZE, SpiDataWidth> dataWidth;
#elif defined(STM32F4)
  RegEnum<IGB_SPI_REG_ADDR(CR1), SPI_CR1_DFF, SpiDataWidth> dataWidth;
#else
  RegEnum<IGB_SPI_REG_ADDR(CR2), SPI_CR2_DS, SpiDataWidth> dataWidth;
#endif

#if defined(STM32H7)
  RegEnum<IGB_SPI_REG_ADDR(CFG1), SPI_CFG1_FTHLV, SpiFifoThreshold> fifoThreshold;
#elif defined(STM32F0) || defined(STM32F3) || defined(STM32G431xx)
  RegEnum<IGB_SPI_REG_ADDR(CR2), SPI_CR2_FRXTH, SpiFifoThreshold> rxFifoThreshold;
#endif

#if defined(STM32H7)
  RegFlag<IGB_SPI_REG_ADDR(CFG1), SPI_CFG1_CRCEN> crc;
#else
  RegFlag<IGB_SPI_REG_ADDR(CR1), SPI_CR1_CRCEN> crc;
#endif

#if defined(STM32H7)
  RegEnum<IGB_SPI_REG_ADDR(CFG1), SPI_CFG1_CRCSIZE, SpiCrcWidth> crcWidth;
#elif defined(STM32F0) || defined(STM32F3) || defined(STM32G431xx)
  RegEnum<IGB_SPI_REG_ADDR(CR1), SPI_CR1_CRCL, SpiCrcWidth> crcWidth;
#endif

#if !defined(STM32H7)
  RegFlag<IGB_SPI_REG_ADDR(CR1), SPI_CR1_CRCNEXT> crcNext;
#endif

#if defined(STM32H7)
  Reg<IGB_SPI_REG_ADDR(CRCPOLY)> crcPolynomial;
#else
  Reg<IGB_SPI_REG_ADDR(CRCPR)> crcPolynomial;
#endif

#if defined(STM32H7)
  Reg<IGB_SPI_REG_ADDR(RXCRC)> rxCrc;
#else
  Reg<IGB_SPI_REG_ADDR(RXCRCR)> rxCrc;
#endif

#if defined(STM32H7)
  Reg<IGB_SPI_REG_ADDR(TXCRC)> txCrc;
#else
  Reg<IGB_SPI_REG_ADDR(TXCRCR)> txCrc;
#endif

#if defined(STM32H7)
  RegEnum<IGB_SPI_REG_ADDR(CFG2), SPI_CFG2_SSM | SPI_CFG2_SSOE, SpiNssMode> nssMode;
#else
  struct SpiNssModeInfo {
    IGB_FAST_INLINE uint32_t operator()() {
      return (IGB_SPI->CR1 & SPI_CR1_SSM) | ((IGB_SPI->CR2 & SPI_CR2_SSOE) << 16U);
    };
    IGB_FAST_INLINE void operator()(SpiNssMode mode) {
      IGB_MODIFY_REG(IGB_SPI->CR1, SPI_CR1_SSM,  as<uint32_t>(mode));
      IGB_MODIFY_REG(IGB_SPI->CR2, SPI_CR2_SSOE, ((uint32_t)(as<uint32_t>(mode) >> 16U)));
    };
  };
  SpiNssModeInfo nssMode;
#endif

#if defined(STM32H7)
  RegFlag<IGB_SPI_REG_ADDR(CFG2), SPI_CFG2_SSOM> nssPulseMng;
#elif defined(STM32F0) || defined(STM32F3) || defined(STM32G431xx)
  RegFlag<IGB_SPI_REG_ADDR(CR2), SPI_CR2_NSSP> nssPulseMng;
#endif

#if defined(STM32H7)
  RegEnum<IGB_SPI_REG_ADDR(CFG2), SPI_CFG2_SSIOP, SpiNssPolarity> nssPolarity;
#endif

#if defined(STM32G431xx)
  // spi i2s
  RegEnum<IGB_SPI_REG_ADDR(I2SCFGR), IGB_BIT(0), I2sChannelLength, 0> i2sChannelLength;
  RegEnum<IGB_SPI_REG_ADDR(I2SCFGR), IGB_BIT_MASK(2, 1), I2sDataLength, 1> i2sDataLength;
  RegEnum<IGB_SPI_REG_ADDR(I2SCFGR), IGB_BIT(3), I2sInActiveClockPolarity, 3> i2sInActiveClockPolarity;
  RegEnum<IGB_SPI_REG_ADDR(I2SCFGR), IGB_BIT_MASK(2, 4), I2sFormat, 4> i2sFormat;
  RegFlag<IGB_SPI_REG_ADDR(I2SCFGR), IGB_BIT(7)> i2sPcmSyncLongFrame;
  RegEnum<IGB_SPI_REG_ADDR(I2SCFGR), IGB_BIT_MASK(2, 8), I2sMode, 8> i2sMode;
  RegFlag<IGB_SPI_REG_ADDR(I2SCFGR), IGB_BIT(10)> i2sEnable;
  RegFlag<IGB_SPI_REG_ADDR(I2SCFGR), IGB_BIT(11)> i2sSelect;
  RegFlag<IGB_SPI_REG_ADDR(I2SCFGR), IGB_BIT(12)> i2sAsyncTransEnable;

  RegValue<IGB_SPI_REG_ADDR(I2SPR), IGB_BIT_MASK(8, 0), 0> i2sPrescaler;
  RegFlag<IGB_SPI_REG_ADDR(I2SPR), IGB_BIT(8)> i2sPrescalerOdd;
  RegFlag<IGB_SPI_REG_ADDR(I2SPR), IGB_BIT(9)> i2sMasterClockOutEnable;

#endif

  IGB_FAST_INLINE bool is(SpiState state) {
    return !!(IGB_SPI->SR & as<uint32_t>(state));
  }
  
  IGB_FAST_INLINE void clear(SpiState state) {
    IGB_CLEAR_BIT(IGB_SPI->SR, as<uint32_t>(state));
  }

#if defined(STM32H7)
  enum class InterruptType : uint32_t {
    rxPacketAbailable = SPI_IER_RXPIE,
    txPacketAbailable = SPI_IER_TXPIE,
    dxPacketAbailable = SPI_IER_DXPIE,
    endOfTransfer     = SPI_IER_EOTIE,
    txTransferFull    = SPI_IER_TXTFIE,
    underrun          = SPI_IER_UDRIE,
    overrun           = SPI_IER_OVRIE,
    crcError          = SPI_IER_CRCEIE,
    frameFormatError  = SPI_IER_TIFREIE,
    modeFault         = SPI_IER_MODFIE,
    dataReloaded      = SPI_IER_TSERFIE,
  };
#else
  enum class InterruptType : uint32_t {
    rxBufNotEmpty     = SPI_CR2_RXNEIE,
    txBufEmpty        = SPI_CR2_TXEIE,
    error             = SPI_CR2_ERRIE,
  };
#endif

  IGB_FAST_INLINE void enable(InterruptType type) {
#if defined(STM32H7)
    IGB_SET_BIT(IGB_SPI->IER, as<uint32_t>(type));
#else
    IGB_SPI->CR2 = IGB_SPI->CR2 | as<uint32_t>(type);
#endif
  }

  IGB_FAST_INLINE void disable(InterruptType type) {
#if defined(STM32H7)
    IGB_CLEAR_BIT(IGB_SPI->IER, as<uint32_t>(type));
#else
    IGB_SPI->CR2 = IGB_SPI->CR2 & ~(as<uint32_t>(type));
#endif
  }

  enum class DmaReqType : uint32_t {
#if defined(STM32H7)
    rx = SPI_CFG1_RXDMAEN,
    tx = SPI_CFG1_TXDMAEN,
#else
    rx = SPI_CR2_RXDMAEN,
    tx = SPI_CR2_TXDMAEN,
#endif
  };

  IGB_FAST_INLINE void enable(DmaReqType type) {
#if defined(STM32H7)
    IGB_SET_BIT(IGB_SPI->CFG1, as<uint32_t>(type));
#else
    IGB_SPI->CR2 = IGB_SPI->CR2 | as<uint32_t>(type);
#endif
  }

  IGB_FAST_INLINE void disable(DmaReqType type) {
#if defined(STM32H7)
    IGB_CLEAR_BIT(IGB_SPI->CFG1, as<uint32_t>(type));
#else
    IGB_SPI->CR2 = IGB_SPI->CR2 & ~(as<uint32_t>(type));
#endif
  }

#if defined(STM32F0) || defined(STM32F3) || defined(STM32G431xx)
  enum class DmaParityTarget : uint32_t {
    rx = SPI_CR2_RXDMAEN,
    tx = SPI_CR2_TXDMAEN,
  };
  enum class DmaParityType : uint32_t {
    even = 0,
    odd  = 1,
  };
  IGB_FAST_INLINE void dmaParity(DmaParityTarget target, DmaParityType type) {
    switch (target) {
      case DmaParityTarget::tx:
        IGB_MODIFY_REG(IGB_SPI->CR2, SPI_CR2_LDMATX, (as<uint32_t>(type) << SPI_CR2_LDMATX_Pos));
        break;
      case DmaParityTarget::rx:
        IGB_MODIFY_REG(IGB_SPI->CR2, SPI_CR2_LDMARX, (as<uint32_t>(type) << SPI_CR2_LDMARX_Pos));
        break;
    }
  }

  IGB_FAST_INLINE uint32_t getRegAddr() {
    return (uint32_t) &(IGB_SPI->DR);
  }
#endif

#if defined(STM32H7)
  RegValue<IGB_SPI_REG_ADDR(CR2), SPI_CR2_TSIZE, 0> transferSize;
  RegFlag<IGB_SPI_REG_ADDR(CR1), SPI_CR1_CSTART> startMasterTransfer;
#endif

  IGB_FAST_INLINE uint8_t receiveU8() {
#if defined(STM32H7)
    return (*((__IO uint8_t *)&IGB_SPI->RXDR));
#else
    return (uint8_t)(IGB_SPI->DR);
#endif
  }

  IGB_FAST_INLINE uint8_t receiveU8sync(auto&& wait_func) {
    //while (is(SpiState::busy)) { wait_func(); }
#if defined(STM32H7)
    while (!is(SpiState::rxPacketAbailable)) { wait_func(); }
    return receiveU8();
#else
    while (!is(SpiState::rxBufNotEmpty)) { wait_func(); }
    return receiveU8();
#endif
  }
  IGB_FAST_INLINE uint8_t receiveU8sync() {
    return receiveU8sync([](){});
  }

