centrevillage/igb_sdk/igb_stm32/periph/spi.hpp
  IGB_FAST_INLINE uint16_t receiveU16() {
#if defined(STM32H7)
    return (uint16_t)(READ_REG(IGB_SPI->RXDR));
#else
    return (uint16_t)(IGB_SPI->DR);
#endif
  }

  IGB_FAST_INLINE uint8_t receiveU16sync(auto&& wait_func) {
    //while (is(SpiState::busy)) { wait_func(); }
#if defined(STM32H7)
    while (!is(SpiState::rxPacketAbailable)) { wait_func(); }
    return receiveU16();
#else
    while (!is(SpiState::rxBufNotEmpty)) { wait_func(); }
    return receiveU16();
#endif
  }
  IGB_FAST_INLINE uint8_t receiveU16sync() {
    return receiveU16sync([](){});
  }

  IGB_FAST_INLINE void sendU8(uint8_t data) {
#if defined(STM32H7)
    *((__IO uint8_t *)&IGB_SPI->TXDR) = data;
#else
#if defined (__GNUC__)
    __IO uint8_t *spidr = ((__IO uint8_t *)&IGB_SPI->DR);
    *spidr = data;
#else
    *((__IO uint8_t *)&IGB_SPI->DR) = data;
#endif /* __GNUC__ */
#endif
  }

  IGB_FAST_INLINE void sendU8sync(uint8_t data, auto&& wait_func) {
#if defined(STM32H7)
    disable();
    transferSize(1);
    enable();
    startMasterTransfer(true);
    while (!is(SpiState::txPacketAbailable)) { wait_func(); }
    sendU8(data);
    while (!is(SpiState::endOfTransfer)) { wait_func(); }
    IGB_SET_BIT(IGB_SPI->IFCR, SPI_IFCR_EOTC);
    IGB_SET_BIT(IGB_SPI->IFCR, SPI_IFCR_TXTFC);
    disable();
    IGB_SPI->IER = IGB_SPI->IER & (~(SPI_IT_EOT | SPI_IT_TXP | SPI_IT_RXP | SPI_IT_DXP | SPI_IT_UDR | SPI_IT_OVR | SPI_IT_FRE | SPI_IT_MODF));
    IGB_CLEAR_BIT(IGB_SPI->CFG1, SPI_CFG1_TXDMAEN | SPI_CFG1_RXDMAEN);
#else
    __IO uint16_t tmp IGB_UNUSED = transferU8sync(data, wait_func);
#endif
  }
  IGB_FAST_INLINE void sendU8sync(uint8_t data) {
    sendU8sync(data, [](){});
  }

  IGB_FAST_INLINE void sendBufU8sync(uint8_t* buffer, size_t size, auto&& wait_func) {
#if defined(STM32H7)
    disable();
    transferSize(size);
    enable();
    startMasterTransfer(true);
    for (size_t i = 0; i < size; ++i) {
      while (!is(SpiState::txPacketAbailable)) { wait_func(); }
      sendU8(buffer[i]);
    }
    while (!is(SpiState::endOfTransfer)) { wait_func(); }
    IGB_SET_BIT(IGB_SPI->IFCR, SPI_IFCR_EOTC);
    IGB_SET_BIT(IGB_SPI->IFCR, SPI_IFCR_TXTFC);
    disable();
    IGB_SPI->IER = IGB_SPI->IER & (~(SPI_IT_EOT | SPI_IT_TXP | SPI_IT_RXP | SPI_IT_DXP | SPI_IT_UDR | SPI_IT_OVR | SPI_IT_FRE | SPI_IT_MODF));
    IGB_CLEAR_BIT(IGB_SPI->CFG1, SPI_CFG1_TXDMAEN | SPI_CFG1_RXDMAEN);
#else
    for (size_t i = 0; i < size; ++i) {
      sendU8sync(buffer[i], wait_func);
    }
#endif
  }
  IGB_FAST_INLINE void sendBufU8sync(uint8_t* buffer, size_t size) {
    sendBufU8sync(buffer, size, [](){});
  }

  IGB_FAST_INLINE void sendU16(uint16_t data) {
#if defined(STM32H7)
#if defined (__GNUC__)
  __IO uint16_t *spitxdr = ((__IO uint16_t *)&IGB_SPI->TXDR);
  *spitxdr = data;
#else
  IGB_SPI->TXDR = data;
#endif
#else
#if defined (__GNUC__)
  __IO uint16_t *spidr = ((__IO uint16_t *)&IGB_SPI->DR);
  *spidr = data;
#else
  IGB_SPI->DR = data;
#endif /* __GNUC__ */
#endif /* defined(STM32H7) */
  }

  IGB_FAST_INLINE uint8_t transferU8sync(uint8_t data, auto&& wait_func) {
#if defined(STM32H7)
    disable();
    transferSize(1);
    enable();
    startMasterTransfer(true);
    while (!is(SpiState::txPacketAbailable)) { wait_func(); }
    sendU8(data);
    while (!is(SpiState::rxPacketAbailable)) { wait_func(); }
    uint8_t result = receiveU8();
    while (!is(SpiState::endOfTransfer)) { wait_func(); }
    IGB_SET_BIT(IGB_SPI->IFCR, SPI_IFCR_EOTC);
    IGB_SET_BIT(IGB_SPI->IFCR, SPI_IFCR_TXTFC);
    disable();
    IGB_SPI->IER = IGB_SPI->IER & (~(SPI_IT_EOT | SPI_IT_TXP | SPI_IT_RXP | SPI_IT_DXP | SPI_IT_UDR | SPI_IT_OVR | SPI_IT_FRE | SPI_IT_MODF));
    IGB_CLEAR_BIT(IGB_SPI->CFG1, SPI_CFG1_TXDMAEN | SPI_CFG1_RXDMAEN);
    return result;
#else
    while (is(SpiState::busy)) { wait_func(); }
    while (!is(SpiState::txBufEmpty))  { wait_func(); }

    sendU8(data);

    while (!is(SpiState::rxBufNotEmpty)) { wait_func(); }

    return receiveU8();
#endif
  }
  IGB_FAST_INLINE uint8_t transferU8sync(uint8_t data) {
    return transferU8sync(data, [](){});
  }

  IGB_FAST_INLINE void prepareGpio(GpioPinType pin_type) {
    auto periph_type = as_periph_type(type);
    if (!periph_type) { return; }

    auto result = get_af_idx(periph_type.value(), pin_type);
    if (!result) { return; }

    GpioPin pin = GpioPin::newPin(pin_type);
    pin.setMode(GpioMode::alternate);
    pin.setPullMode(GpioPullMode::no);
    pin.setSpeedMode(GpioSpeedMode::high);
    pin.setOutputMode(GpioOutputMode::pushpull);
    pin.setAlternateFunc(result.value());
    pin.enable();
  }

  IGB_FAST_INLINE void initDefault() {
#if defined(STM32H7)
    nssPolarity(SpiNssPolarity::low);
    standard(SpiStandard::motorola);
    fifoThreshold(SpiFifoThreshold::_1data);
    nssPulseMng(false);

    crc(false);
    dataWidth(SpiDataWidth::_8bit);

    IGB_SET_BIT(IGB_SPI->CR1, SPI_CR1_SSI); // avoid a MODF Error

    nssMode(SpiNssMode::soft);
    clockPolarity(SpiClockPolarity::low);
    clockPhase(SpiClockPhase::oneEdge);
    transBitOrder(SpiBitOrder::msbFirst);
    mode(SpiMode::master);
    transDir(SpiTransDir::fullDuplex);
#elif defined(STM32F0) || defined(STM32F3) || defined(STM32G431xx)
    transDir(SpiTransDir::fullDuplex);
    mode(SpiMode::master);
    dataWidth(SpiDataWidth::_8bit);
    clockPolarity(SpiClockPolarity::low);
    clockPhase(SpiClockPhase::oneEdge);
    nssMode(SpiNssMode::soft);
    transBitOrder(SpiBitOrder::msbFirst);
    crc(false);
    crcPolynomial(7);
    standard(SpiStandard::motorola);
    rxFifoThreshold(SpiFifoThreshold::quarter);
    nssPulseMng(true);
#endif
  }

  IGB_FAST_INLINE void initMaster(SpiBaudratePrescaler prescaler = SpiBaudratePrescaler::div16) {
    enableBusClock();
    prepareGpio(mosi_pin);
    prepareGpio(miso_pin);
    prepareGpio(sck_pin);

    baudratePrescaler(prescaler);
    initDefault();
    enable();
  }

  IGB_FAST_INLINE void initMasterOutOnly(SpiBaudratePrescaler prescaler) {
    enableBusClock();
    prepareGpio(mosi_pin);
    prepareGpio(sck_pin);

#if defined(STM32H7)
    nssPolarity(SpiNssPolarity::low);
    standard(SpiStandard::motorola);
    fifoThreshold(SpiFifoThreshold::_1data);
    nssPulseMng(false);

    baudratePrescaler(prescaler);
    crc(false);
    dataWidth(SpiDataWidth::_8bit);

    IGB_SET_BIT(IGB_SPI->CR1, SPI_CR1_SSI); // avoid a MODF Error

