centrevillage/igb_sdk/igb_stm32/periph/spi.hpp
    nssMode(SpiNssMode::soft);
    clockPolarity(SpiClockPolarity::low);
    clockPhase(SpiClockPhase::oneEdge);
    transBitOrder(SpiBitOrder::msbFirst);
    mode(SpiMode::master);
    transDir(SpiTransDir::simplexTx);
#if defined(SPI_I2SCFGR_I2SMOD)
    IGB_CLEAR_BIT(IGB_SPI->I2SCFGR, SPI_I2SCFGR_I2SMOD);
#endif
    IGB_CLEAR_BIT(IGB_SPI->CR1, SPI_CR1_TCRCINI);
    IGB_CLEAR_BIT(IGB_SPI->CR1, SPI_CR1_RCRCINI);
    IGB_CLEAR_BIT(IGB_SPI->CFG2, SPI_CFG2_AFCNTR);
    IGB_CLEAR_BIT(IGB_SPI->CFG2, SPI_CFG2_IOSWP);
    IGB_MODIFY_REG(IGB_SPI->CFG2, 0xFFUL, 0x00UL);
#else
    baudratePrescaler(prescaler);
    initDefault();
#endif
    enable();
  }

  IGB_FAST_INLINE void initMasterOutOnlyHardSS(GpioPinType cs_pin, SpiBaudratePrescaler prescaler) {
    enableBusClock();
    prepareGpio(mosi_pin);
    prepareGpio(sck_pin);
    prepareGpio(cs_pin);

#if defined(STM32H7)
    nssPolarity(SpiNssPolarity::low);
    standard(SpiStandard::motorola);
    fifoThreshold(SpiFifoThreshold::_1data);
    nssPulseMng(true);

    baudratePrescaler(prescaler);
    crc(false);
    dataWidth(SpiDataWidth::_8bit);

    IGB_SET_BIT(IGB_SPI->CR1, SPI_CR1_SSI); // avoid a MODF Error

    nssMode(SpiNssMode::hardOutput);
    clockPolarity(SpiClockPolarity::low);
    clockPhase(SpiClockPhase::oneEdge);
    transBitOrder(SpiBitOrder::msbFirst);
    mode(SpiMode::master);
    transDir(SpiTransDir::simplexTx);
#if defined(SPI_I2SCFGR_I2SMOD)
    IGB_CLEAR_BIT(IGB_SPI->I2SCFGR, SPI_I2SCFGR_I2SMOD);
#endif
    IGB_CLEAR_BIT(IGB_SPI->CR1, SPI_CR1_TCRCINI);
    IGB_CLEAR_BIT(IGB_SPI->CR1, SPI_CR1_RCRCINI);
    IGB_CLEAR_BIT(IGB_SPI->CFG2, SPI_CFG2_AFCNTR);
    IGB_CLEAR_BIT(IGB_SPI->CFG2, SPI_CFG2_IOSWP);
    IGB_MODIFY_REG(IGB_SPI->CFG2, 0xFFUL, 0x00UL);
#else
    baudratePrescaler(prescaler);
    initDefault();
#endif
    enable();
  }

  IGB_FAST_INLINE void initMasterInputOnly(SpiBaudratePrescaler prescaler, SpiDataWidth data_width = SpiDataWidth::_8bit) {
    enableBusClock();
    prepareGpio(miso_pin);
    prepareGpio(sck_pin);

#if defined(STM32H7)
    nssPolarity(SpiNssPolarity::low);
    standard(SpiStandard::motorola);
    fifoThreshold(SpiFifoThreshold::_1data);
    nssPulseMng(false);

    baudratePrescaler(prescaler);
    crc(false);
    dataWidth(data_width);

    IGB_SET_BIT(IGB_SPI->CR1, SPI_CR1_SSI); // avoid a MODF Error

    nssMode(SpiNssMode::soft);
    clockPolarity(SpiClockPolarity::low);
    clockPhase(SpiClockPhase::oneEdge);
    transBitOrder(SpiBitOrder::msbFirst);
    mode(SpiMode::master);
    transDir(SpiTransDir::simplexRx);
#if defined(SPI_I2SCFGR_I2SMOD)
    IGB_CLEAR_BIT(IGB_SPI->I2SCFGR, SPI_I2SCFGR_I2SMOD);
#endif
    IGB_CLEAR_BIT(IGB_SPI->CR1, SPI_CR1_TCRCINI);
    IGB_CLEAR_BIT(IGB_SPI->CR1, SPI_CR1_RCRCINI);
    IGB_CLEAR_BIT(IGB_SPI->CFG2, SPI_CFG2_AFCNTR);
    IGB_CLEAR_BIT(IGB_SPI->CFG2, SPI_CFG2_IOSWP);
    IGB_MODIFY_REG(IGB_SPI->CFG2, 0xFFUL, 0x00UL);
#else
    baudratePrescaler(prescaler);
    //transDir(SpiTransDir::simplexRx);
    transDir(SpiTransDir::fullDuplex);
    mode(SpiMode::master);
    dataWidth(data_width);
    clockPolarity(SpiClockPolarity::low);
    clockPhase(SpiClockPhase::oneEdge);
    nssMode(SpiNssMode::soft);
    transBitOrder(SpiBitOrder::msbFirst);
    crc(false);
    crcPolynomial(7);
    standard(SpiStandard::motorola);
    rxFifoThreshold(SpiFifoThreshold::quarter);
    nssPulseMng(false);
#endif
    enable();
  };

  IGB_FAST_INLINE void initMasterInputOnlyHardSS(GpioPinType cs_pin, SpiBaudratePrescaler prescaler, SpiDataWidth data_width = SpiDataWidth::_8bit) {
    enableBusClock();
    prepareGpio(miso_pin);
    prepareGpio(sck_pin);
    prepareGpio(cs_pin);

#if defined(STM32H7)
    nssPolarity(SpiNssPolarity::low);
    standard(SpiStandard::motorola);
    fifoThreshold(SpiFifoThreshold::_1data);
    nssPulseMng(true);

    baudratePrescaler(prescaler);
    crc(false);
    dataWidth(data_width);

    IGB_SET_BIT(IGB_SPI->CR1, SPI_CR1_SSI); // avoid a MODF Error

    nssMode(SpiNssMode::hardOutput);
    clockPolarity(SpiClockPolarity::low);
    clockPhase(SpiClockPhase::oneEdge);
    transBitOrder(SpiBitOrder::msbFirst);
    mode(SpiMode::master);
    transDir(SpiTransDir::simplexRx);
#if defined(SPI_I2SCFGR_I2SMOD)
    IGB_CLEAR_BIT(IGB_SPI->I2SCFGR, SPI_I2SCFGR_I2SMOD);
#endif
    IGB_CLEAR_BIT(IGB_SPI->CR1, SPI_CR1_TCRCINI);
    IGB_CLEAR_BIT(IGB_SPI->CR1, SPI_CR1_RCRCINI);
    IGB_CLEAR_BIT(IGB_SPI->CFG2, SPI_CFG2_AFCNTR);
    IGB_CLEAR_BIT(IGB_SPI->CFG2, SPI_CFG2_IOSWP);
    IGB_MODIFY_REG(IGB_SPI->CFG2, 0xFFUL, 0x00UL);
#else
    baudratePrescaler(prescaler);
    transDir(SpiTransDir::simplexRx);
    mode(SpiMode::master);
    dataWidth(data_width);
    clockPolarity(SpiClockPolarity::low);
    clockPhase(SpiClockPhase::oneEdge);
    nssMode(SpiNssMode::hardOutput);
    transBitOrder(SpiBitOrder::msbFirst);
    crc(false);
    crcPolynomial(7);
    standard(SpiStandard::motorola);
    rxFifoThreshold(SpiFifoThreshold::quarter);
    nssPulseMng(true);
  #endif
    enable();
  }


  IGB_FAST_INLINE void init(SpiBaudratePrescaler prescaler = SpiBaudratePrescaler::div16) {
    // TODO: config default prescaler
    initMaster(prescaler);
  }
};

#undef IGB_SPI_REG
#undef IGB_SPI_REG_ADDR
#undef IGB_SPI

}
}

